package recurse

func isPowerOfTwo(n int) bool {
	if n <= 0 {
		return false
	}
	if n == 1 {
		return true
	}

	for n > 1 {
		if n%2 > 0 {
			return false
		}
		n = n >> 1
	}

	return n == 1
	// return true
}

func isPowerOfTwoRecurse(n int) bool {
	if n <= 0 {
		return false
	}
	if n == 1 {
		return true
	}

	if n%2 > 0 {
		return false
	}

	return isPowerOfTwoRecurse(n >> 1)
}

// 注意，我经常这么说但不正确：8 的二进制表示最高位为 1。
// 因为如果是 32 位有符号整数，8 的二进制表示为 0...01000，
// 1 的左侧还有28个0，因此不能说其最高位为 1，只能说其二进制表示中只有一个 1
//
//
// 算法思路推导：
// 如果 n 是 2 的幂，那么
//   n 的二进制表示只有一位是 1，其他位全都为 0
//   n-1 的二进制表示除最低位外全部是 0，最低位是 1。
//     因为 n 只有一位是 1，且在高位，减 1 就会从最低位开始，逐个向高一位借 1。
//   n 和 n-1 进行按位与运算，结果必然为 0。
//
// 【n & (n-1)：将 n 最右边的 1 置为 0】

func isPowerOfTwo_BitAnd(n int) bool {
	return n > 0 && (n&(n-1)) == 0
}

// 算法思路推导：
// 如果 n 是 2 的幂，那么其二进制表示中只有一个 1，
// 那么，问题就转化为判断其二进制表示中是否只有一个 1。
// `n & (-n)` 可以留下 n 最右边的那个 1，也就是说，结果仍为 n
//
// 为什么和 -n 按位与能产生这种效果？
//
// 首先，得搞清楚计算机如何表示负数。计算机通常使用补码表示负数：
// 先按位取反，再加 1。
//
// 假设 n 是 8 位有符号整数，n = 12。
// 8 位二进制表示：     00001100
// 按位取反(~12)：     11110011
// 再加 1 (-n)：      11110100
// 按位与（n&-n）：
//  n = 00001100
// -n = 11110100
//      ---------
//  & = 00000100
// 结果是 4，而不是 12。
// 从结果的二进制表示看，它确实保留了 12 的二进制表示最右边的 1，其他位全部是 0。
//
// 假设 n=8。因为 8 的二进制表示是 00001000，所以 (8 & -8) = 8
//
// 【n & (-n)：只保留 n 最右边的 1，其他全置为 0】

func isPowerOfTwo_BitAnd2(n int) bool {
	return n > 0 && (n&-n) == n
}

// 一个基于题目规定的较为取巧的做法
//
// 算法思路推导：
// 题目规定，n 在 32 位有符号整数范围内。
// 判断 n 是否是「32 位有符号整数的范围内」最大的 2 的幂的约数，即 2^30 是否能被 n 整除
// 为什么最大的 2 的幂不是 2^31 呢？

func isPowerOfTwo_divisor(n int) bool {
	const big = 1 << 30
	return n > 0 && big%n == 0

	// 在 Go 中 `^` 不是乘方，而是按位异或运算
	// return n > 0 && 2^30%n == 0
}
