package twopointer

// 区间指针
// |-------|-------|-----------------|
//   非0区     0区        未处理区
//         p       q

// 算法思路：
// 初始时，非0区、0区都不存在，因此
//   将 p 初始化为 -1，这样需要时向右移动一次，即可记录新增非零元素；
//   q 是 0 区右侧开边界，又是未处理区左侧闭边界，因此必须初始化为 0。
// [x, p] 是非0区，(p, q) 是0区，[q, n) 是未处理区。
// p 是非0区右侧闭边界，p、q 分别是0区左右开边界，q 是未处理区左闭边界。
//
// 遍历未处理区，执行下述步骤：
// 1. 若等于 0，右移 q，将当前元素计入 0 区。
//    即将0区右开边界右移一位，和未处理区左闭边界右移一位
// 2. 若不等于 0，交换 nums[p+1] 和 nums[q]，右移 p 和 q。
//    即将0区末尾之后的那个非零元素跟0区首元素交换，
//    再将非0区右侧闭边界向右移动，以计入新增的非0元素，
//    右移 0 区右开边界，以计入换过来的 0 元素

func moveZeroes(nums []int) {
	p, q := -1, 0

	// 注意：为什么这里没有显式确保 p 不会越界？
	// 因为初始时 p 比 q 小 1（即 q 在前，p 在后），且两个指针要么一起移动，要么只移动 q
	// 所以只要确保 q 不越界，p 自然不会越界
	for q < len(nums) {
		v := nums[q]
		if v == 0 {
			// 0 区右侧开边界右移一位，以计入当前元素
			q++
		} else if v != 0 {
			nums[p+1], nums[q] = nums[q], nums[p+1]
			// 右移非 0 区右闭边界，以计入新增的非 0 元素
			// 右移 0 区右开边界，以计入换过来的 0 元素
			p++
			q++
		}
	}
}

// 算法思路：
// 初始时，非0区、0区都不存在，因此
//   将 p 初始化为 0，表示非0区右侧开边界，这样需要时向右移动一次，即可计入新增非零元素；
//   q 是 0 区右侧开边界，又是未处理区左侧闭边界，因此必须初始化为 0。
// [x, p) 是非 0 区，[p, q) 是 0 区，[q, n) 是未处理区
// 刚开始 p、q 都是 0，意味着非零区、零区的右边界是混沌未分，重叠在一起的

func moveZeroes2(nums []int) {
	p, q := 0, 0
	for q < len(nums) {
		if nums[q] == 0 {
			q++ // 将当前元素添加至0区末尾
		} else {
			// 交换 0 区左边界和nums[q]，再
			// 右移非 0 区右开边界，以计入新增非 0 元素
			// 右移 0 区右开边界，以计入换过来的 0 元素
			nums[p], nums[q] = nums[q], nums[p]
			p++
			q++
		}
	}
}
