package dp

// https://leetcode.cn/problems/best-time-to-buy-and-sell-stock-with-cooldown/description/

// 状态模型：
// 状态指一天结束时的状态，而非一天开始时或任何时候的状态。一天结束时的状态才决定下一天可做的操作。
// 不持有，自由空仓 --买入-> 持有
//          ｜             |
//       冷冻结束          卖出
//          ｜             |
//       冷冻一天 <------ 刚卖出
// 注意，虽然有“冷冻一天”状态，但这里的状态转移可以跳过它，即直接从刚卖出转移到自由空仓。因为这里的
// 状态仅指一天结束时的状态，所以即使当天开始时状态为“冷冻一天”，当天结束时状态也不再是“冷冻一天”，
// 而是“自由空仓”状态。如果选择将当天结束时的状态建模为“冷冻一天”，那么就必须添加一个状态转移方程，
// 以从“冷冻一天”状态转移为“自由空仓”，但是这个转移貌似没有任何实际价值，因为这个转移对应的时间区间
// 为前一天结束到第二天开始。在此期间，你的现金利润不可能发生任何变化。
//
// 状态表：
// dp[n][3]，3 表示有三个状态，单元格为当天达到目标状态后可达到的最大现金利润
// dp[i][0] 表示持有
// dp[i][1] 表示自由空仓
// dp[i][2] 表示刚卖出
//
// 状态转移方程：
// 当天持有 = max(昨天持有，昨天自由空仓-当天买入prices[i])
// 当天自由空仓 = max(昨天自由空仓，昨天刚卖出)
// 当天刚卖出 = 昨天持有+当天卖出prices[i]-fee
//
// “如果昨天刚卖出，今天不能买入”这个约束如何表达的？
// 在“当天持有”的转移方程中，没有“昨天刚卖出 -> 今天买入”这条状态转移路径。
// 但你仍可能疑惑，“当天自由空仓”方程不是把“刚卖出”变成“自由空仓”了吗？
// 注意它得到的是今天结束时的自由空仓，只能用于明天买入，不能用于今天买入。所有方程右边都使用昨天的状态。
// 所以时间线是：昨天卖出 → 今天冷冻一天，结束时恢复自由 → 明天可以买

func maxProfit2(prices []int) int {
	n := len(prices)
	dp := make([][]int, n)
	for i := range dp {
		dp[i] = make([]int, 3)
	}

	// 初始化第一天
	dp[0][0] = -prices[0] // 持有
	dp[0][1] = 0          // 不持有，自由空仓
	// 不持有，刚卖出。第一天不可能，因为不允许一天内多次买卖，所以只能设为 0
	dp[0][2] = 0
	for i := 1; i < n; i++ {
		dp[i][0] = max(dp[i-1][0], dp[i-1][1]-prices[i])
		// dp[i-1][2] 第二维是昨天结束时的状态，dp[i][1] 第二维是今天结束时的状态
		// 昨天结束时是刚卖出，今天冷冻一天，结束时是自由空仓
		dp[i][1] = max(dp[i-1][1], dp[i-1][2])
		dp[i][2] = dp[i-1][0] + prices[i]
	}

	return max(dp[n-1][0], dp[n-1][1], dp[n-1][2])
}
